Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-Farhan-Ahmed]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=e6e333ef-50cf-4768-b094-0cdac87aebc3]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-Farhan-Ahmed]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=farhanahmedhellokitty]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_28a77a46-8509-47b2-b0f4-d4486158bd90.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Farhan-Ahmed:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-Farhan-Ahmed]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=farhanahmedhellokitty]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=farhanahmedhellokitty]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-farhanahmedhellokitty]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=farhanahmedhellokitty]
module.appcd_9396c206-41bc-4770-916e-000625956eef.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Farhan-Ahmed:aws_s3-hello-kitty-policy]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-Farhan-Ahmed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-function-Farhan-Ahmed" -> "hellokittyfarhanahmed" # forces replacement
      ~ id                             = "hello-kitty-function-Farhan-Ahmed" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T09:51:29.514+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "HelloKittyAppDeploy"
            "component" = "hello-kitty"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "hello-kitty-function-Farhan-Ahmed" -> "farhanahmedhellokitty"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-function-Farhan-Ahmed" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed" -> (known after apply)
      ~ function_name      = "hello-kitty-function-Farhan-Ahmed" -> "hellokittyfarhanahmed" # forces replacement
      ~ function_url       = "https://oh5tiie6hz7qukbxyk45m2afxm0jallr.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-function-Farhan-Ahmed" -> (known after apply)
      ~ url_id             = "oh5tiie6hz7qukbxyk45m2afxm0jallr" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - aws_lambda_hello_kitty_function_farhan_ahmed_function_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed" -> null
  - aws_lambda_hello_kitty_function_farhan_ahmed_function_name                 = "hello-kitty-function-Farhan-Ahmed" -> null
  - aws_lambda_hello_kitty_function_farhan_ahmed_function_url                  = "https://oh5tiie6hz7qukbxyk45m2afxm0jallr.lambda-url.us-west-2.on.aws/" -> null
  - aws_lambda_hello_kitty_function_farhan_ahmed_invoke_arn                    = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Farhan-Ahmed/invocations" -> null
  + aws_lambda_hellokittyfarhanahmed_function_arn                              = (known after apply)
  + aws_lambda_hellokittyfarhanahmed_function_name                             = "hellokittyfarhanahmed"
  + aws_lambda_hellokittyfarhanahmed_function_url                              = (known after apply)
  + aws_lambda_hellokittyfarhanahmed_invoke_arn                                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```